In [58]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [59]:
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer
from sklearn.compose import ColumnTransformer

In [60]:
df = pd.read_csv("sample_data_with_nulls.csv")

In [61]:
df2 = df[['Age','Height_cm','Weight_kg']]

In [62]:
df.isnull().sum()

ID           0
Name         0
Age          2
Height_cm    2
Weight_kg    2
dtype: int64

In [63]:
df.isnull().mean()

ID           0.00
Name         0.00
Age          0.25
Height_cm    0.25
Weight_kg    0.25
dtype: float64

In [64]:
age_mean = df2['Age'].mean()
Height_cm_mean = df2['Height_cm'].mean()
Weight_kg_mean = df2['Weight_kg'].mean()

In [66]:
df2['Age'] = df['Age'].fillna(age_mean)
df2['Height_cm'] = df['Height_cm'].fillna(Height_cm_mean)
df['Weight_kg'] = df['Weight_kg'].fillna(Weight_kg_mean)

C:\Users\udays\AppData\Local\Temp\ipykernel_728\2181497782.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['Age'] = df['Age'].fillna(age_mean)
C:\Users\udays\AppData\Local\Temp\ipykernel_728\2181497782.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['Height_cm'] = df['Height_cm'].fillna(Height_cm_mean)

In [67]:
df['Age'].isnull().sum()
df['Height_cm'].isnull().sum()
df['Height_cm'].isnull().sum()

2

In [68]:
df2

    Age   Height_cm  Weight_kg
0  25.0  165.000000       55.0
1  30.0  170.333333       70.0
2  30.0  180.000000       80.0
3  22.0  175.000000        NaN
4  28.0  160.000000       60.0
5  35.0  170.333333       75.0
6  30.0  170.000000        NaN
7  40.0  172.000000       68.0

In [69]:
df

   ID     Name   Age  Height_cm  Weight_kg
0   1    Alice  25.0      165.0       55.0
1   2      Bob  30.0        NaN       70.0
2   3  Charlie   NaN      180.0       80.0
3   4    David  22.0      175.0       68.0
4   5      Eve  28.0      160.0       60.0
5   6    Frank  35.0        NaN       75.0
6   7    Grace   NaN      170.0       68.0
7   8     Hank  40.0      172.0       68.0